In [8]:
import numpy as np
import matplotlib
import pandas as pd

In [9]:
df = pd.read_excel(r'C:\Users\Rif010\Desktop\Clustering\Cluster.xlsx', sheet_name="selfmade")
df.head(10)

                    Place Name       Place type  Super type
0             Malone-Mcconnell  physiotherapist      Health
1             Frazier-Alvarado          rv park       Store
2  Sweeney, Jones and Reynolds           lawyer     Service
3                Dyer and Sons  veterinary care      Health
4                Carson-Morgan        synagogue   Religious
5                    Joyce-Fox       shoe store       Store
6                Dyer and Sons  veterinary care      Health
7                Carson-Morgan        synagogue   Religious
8   Calhoun, Bradshaw and Ruiz           bakery        Food
9            Stephens-Jacobson           casino  Recreation

In [10]:
feat = pd.get_dummies(df['Super type'])
feat.head()

,Finance,Food,Health,Job,Luxury,Recreation,Religious,Service,Store,Study,Travel
0,0,0,1,0,0,0,0,0,0,0,0
1,0,0,0,0,0,0,0,0,1,0,0
2,0,0,0,0,0,0,0,1,0,0,0
3,0,0,1,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,1,0,0,0,0

In [14]:
X = feat[0:10]
Y = feat[11:21]
X = X.sum(axis = 0)
Y = Y.sum(axis = 0)
x = X.to_numpy()
x = x.reshape(1,-1)
y = Y.to_numpy()
y = y.reshape(1,-1)
x,y

(array([[0, 1, 3, 0, 0, 1, 2, 1, 2, 0, 0]], dtype=int64),
 array([[2, 0, 0, 2, 2, 1, 0, 0, 0, 2, 1]], dtype=int64))

In [12]:
from sklearn.metrics.pairwise import cosine_similarity
from scipy.stats import pearsonr

In [16]:
p = cosine_similarity(x,y)
p[0][0]

0.052704627669472995

In [18]:
p,_ = pearsonr(X,Y)
p

-0.8207036138391905